import React, { Component } from "react"
const title = "Политика конфиденциальности персональной информации"

export default class PolitikaKonfidentsialnosti extends Component {
  static title = title

  componentDidMount() {
    document.title = title
    window.scrollTo(0, 0)
  }

  render() {
    return (
      <main
        style={{ paddingBottom: "50px", fontSize: "14px", paddingTop: "20px" }}
      >
        <h1>{title}</h1>
        <p>
          Настоящая Политика конфиденциальности персональной информации (далее —
          Политика) действует в отношении всей информации, размещенной на сайте
          в сети Интернет по адресу: www.yoursite.ru (далее – Сайт), которую
          посетители, другие пользователи, Администрация Сайта, могут получить о
          пользователе во время использования им Сайта, его сервисов, программ и
          продуктов. Согласие пользователя на предоставление персональной
          информации, данное им в соответствии с настоящей Политикой в рамках
          отношений с одним из лиц, входящих, распространяется на все лица.
        </p>
        <p>
          Использование Сайта означает безоговорочное согласие пользователя с
          настоящей Политикой и указанными в ней условиями обработки его
          персональной информации; в случае несогласия с этими условиями
          пользователь должен воздержаться от использования Сервисов.
        </p>

        <p>
          1. Персональная информация пользователей, которую получает и
          обрабатывает Сайт
        </p>

        <p>
          1.1. В рамках настоящей Политики под «персональной информацией
          пользователя» понимаются:
        </p>

        <p>
          1.1.1. Персональная информация, которую пользователь предоставляет о
          себе самостоятельно заполнении форм обратной связи, включая
          персональные данные пользователя. Обязательная для предоставления
          Сервисов (оказания услуг) информация помечена специальным образом.
          Иная информация предоставляется пользователем на его усмотрение.
        </p>

        <p>
          1.1.2 Данные, которые автоматически передаются в процессе их
          использования с помощью установленного на устройстве пользователя
          программного обеспечения, в том числе IP-адрес, информация из cookie,
          информация о браузере пользователя (или иной программе, с помощью
          которой осуществляется доступ к Сервисам), время доступа, адрес
          запрашиваемой страницы.
        </p>

        <p>
          1.2. Настоящая Политика применима только к https://www.yoursite.ru/ .
          Сайт не контролирует и не несет ответственность за сайты третьих лиц,
          на которые пользователь может перейти по ссылкам, доступным на сайтах
          https://www.yoursite.ru/ , в том числе в результатах поиска. На таких
          сайтах у пользователя может собираться или запрашиваться иная
          персональная информация, а также могут совершаться иные действия.
        </p>

        <p>
          1.3. Сайт в общем случае не проверяет достоверность персональной
          информации, предоставляемой пользователями, и не осуществляет контроль
          за их дееспособностью. Однако Сайт исходит из того, что пользователь
          предоставляет достоверную и достаточную персональную информацию по
          вопросам, предлагаемым в форме регистрации, и поддерживает эту
          информацию в актуальном состоянии.
        </p>

        <p>2. Цели сбора и обработки персональной информации пользователей</p>

        <p>
          2.1. Сайт собирает и хранит только те персональные данные, которые
          необходимы для предоставления и оказания услуг (исполнения соглашений
          и договоров с пользователем).
        </p>

        <p>
          2.2. Персональную информацию пользователя Сайт обрабатывает и может
          использовать в следующих целях:
        </p>

        <p>
          2.2.1. Идентификация стороны в рамках соглашений и договоров,
          заключаемых с использованием Сайта https://www.yoursite.ru/
        </p>

        <p>2.2.2. Предоставление пользователю персонализированных услуг;</p>

        <p>
          2.2.3. Обратная связь с пользователем, в том числе направление
          уведомлений, запросов и информации, касающихся использования Сервисов,
          оказания услуг, а также обработка запросов и заявок от пользователя на
          покупку товара/ов;
        </p>

        <p>
          2.2.4. Улучшение качества, удобства их использования, разработка
          услуг;
        </p>

        <p>2.2.5. Таргетирование рекламных материалов;</p>

        <p>
          2.2.6. Проведение статистических и иных исследований на основе
          обезличенных данных;
        </p>

        <p>
          2.2.7. Определения места нахождения пользователя для обеспечения
          безопасности, предотвращения мошенничества;
        </p>

        <p>
          2.2.8. Подтверждения достоверности и полноты персональных данных,
          предоставленных Пользователем;
        </p>

        <p>
          2.2.9. Предоставления пользователю эффективной клиентской и
          технической поддержки при возникновении проблем, связанных с
          использованием Сайта.
        </p>

        <p>
          3. Условия обработки персональной информации пользователя и её
          передачи третьим лицам
        </p>

        <p>
          3.1. Сайт хранит персональную информацию пользователей в соответствии
          с внутренними регламентами конкретных сервисов.
        </p>

        <p>
          3.2. В отношении персональной информации пользователя сохраняется ее
          конфиденциальность, кроме случаев добровольного предоставления
          пользователем информации о себе для общего доступа неограниченному
          кругу лиц.
        </p>

        <p>
          При использовании отдельных Сервисов пользователь соглашается с тем,
          что определённая часть его персональной информации становится
          общедоступной.
        </p>

        <p>
          3.3. Сайт вправе передать персональную информацию пользователя третьим
          лицам в следующих случаях:
        </p>

        <p>3.3.1. Пользователь выразил свое согласие на такие действия;</p>

        <p>
          3.3.2. Передача необходима в рамках использования пользователем
          определенного Сервиса либо для оказания услуги пользователю;
        </p>

        <p>
          3.3.3. Передача предусмотрена российским или иным применимым
          законодательством в рамках установленной законодательством процедуры;
        </p>

        <p>
          3.3.4. Такая передача происходит в рамках продажи или иной передачи
          бизнеса (полностью или в части), при этом к приобретателю переходят
          все обязательства по соблюдению условий настоящей Политики
          применительно к полученной им персональной информации;
        </p>

        <p>
          3.3.5. В целях обеспечения возможности защиты прав и законных
          интересов иных пользователей или третьих лиц в случаях, когда
          пользователь нарушает Пользовательское соглашение сервисов Сайта .
        </p>

        <p>
          3.4. При обработке персональных данных пользователей Сайт
          руководствуется Федеральным законом РФ «О персональных данных».
        </p>

        <p>4. Изменение пользователем персональной информации</p>

        <p>
          4.1. Пользователь может в любой момент изменить (обновить, дополнить)
          предоставленную им персональную информацию или её часть, а также
          параметры её конфиденциальности.
        </p>

        <p>
          4.2. Пользователь обязан своевременно обновлять, дополнять
          предоставленную информацию о персональных данных в случае изменения
          данной информации.
        </p>

        <p>
          5. Меры, применяемые для защиты персональной информации пользователей
        </p>

        <p>
          5.1. Сайт принимает необходимые и достаточные организационные и
          технические меры для защиты персональной информации пользователя от
          неправомерного или случайного доступа, уничтожения, изменения,
          блокирования, копирования, распространения, а также от иных
          неправомерных действий с ней третьих лиц.
        </p>

        <p>
          5.2. В случае утраты или разглашения конфиденциальной информации
          Администрация Сайта не несет ответственности, если данная
          конфиденциальная информация:
        </p>

        <p>5.2.1. Стала публичным достоянием до ее утраты или разглашения.</p>

        <p>
          5.2.2. Была получена от третьей стороны до момента ее получения
          Администрацией Сайта.
        </p>

        <p>5.2.3. Была разглашена с согласия Пользователя.</p>

        <p>
          6. Изменение Политики конфиденциальности. Применимое законодательство
        </p>

        <p>
          6.1. Сайт имеет право вносить изменения в настоящую Политику
          конфиденциальности без согласия пользователя. При внесении изменений в
          актуальной редакции указывается дата последнего обновления. Новая
          редакция Политики вступает в силу с момента ее размещения, если иное
          не предусмотрено новой редакцией Политики.
        </p>

        <p>
          6.2. К настоящей Политике и отношениям между пользователем и
          https://www.yoursite.ru/, возникающим в связи с применением Политики
          конфиденциальности, подлежит применению право Российской Федерации.
        </p>
      </main>
    )
  }

  shouldComponentUpdate() {
    return false
  }
}
