export default [
  {
    name: "Амадей",
    prefix: "Амадей:",
  },

  {
    name: "БоссаНова",
    prefix: "БН-Тон",
  },

  {
    name: "Вернисаж",
    prefix: "Вернисаж:",
  },

  {
    name: "Кавелио",
    prefix: "Кавелио:",
  },

  {
    name: "Натур Мебель",
    prefix: "Натур Мебель:",
  },

  {
    name: "ТКП",
    prefix: "ТКП",
  },

  {
    name: "Цвета животных",
    imageFolder: "beast-colors/",
  },

  {
    name: "Ral",
    prefix: "Ral ",
  },

  {
    name: "Сурская кухни столешницы",
    imageFolder: "surskaya-kuhni/st/",
  },

  {
    name: "Сурская кухни цвета",
    imageFolder: "surskaya-kuhni/c/",
    additional: [
      "Сурская: Айленд силк",
      "Сурская: Антрацит глянец",
      "Сурская: Белый софт",
      "Сурская: Бордовый",
      "Сурская: Ваниль",
      "Сурская: Гейнсборо силк",
      "Сурская: Капучино глянец",
      "Сурская: Латте софт",
      "Сурская: Маренго силк",
      "Сурская: Смоки софт",
    ],
  },

  {
    name: "Шале столешницы",
    prefix: "Шале столешницы:",
  },

  {
    name: "Шале ВМК",
    prefix: "Шале ВМК:",
  },
]
