import translite from "utils/translite"
import getNoIndexURLS from "../getNoIndexURLS"

export const RU = [
  "Компьютерные",
  "Офисные",
  "Для руководителя",
  "Игровые",
  "Из ротанга",
  "Кожаные",
  "Классические",
  "Детские",
  "Для дома",
  "С реклайнером",
  "Экокожа",
  "Ткань",
  "Сетка",
  "Ортопедические",
  "Эргономичные",
  "Большие",
  "Белые",
  "Черные",
  "Бежевые",
  "Недорогие",
  "На колесиках",
  "Кожа",
  "Пластик",
  "Металл",
  "Хром",
  "Мягкие",
  "Высокие",
  "Серые",
  "Красные",
  "Коричневые",
  "Для компьютера",
  "Для геймеров",
  "Папасаны",
  "Круглые",
  "Плетеные",
  "Садовые",
  "С подушкой",
  "Раскладные",
]

export const ENG = RU.map(v => translite(v, "-"))

export const DATA = [
  {
    name: 0,
    values: [7, 3, 1, 2, 8, 9, 5, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19],
  },
  {
    name: 1,
    values: [
      2, 13, 20, 21, 10, 11, 22, 23, 24, 12, 25, 26, 17, 16, 18, 27, 28, 19,
    ],
  },
  { name: 2, values: [21, 10, 11, 12, 24, 23, 22, 9, 17, 16, 18, 29, 27, 19] },
  { name: 3, values: [30, 31, 9, 21, 28, 16, 17, 19] },
  { name: 4, values: [32, 33, 34, 35, 36, 19] },
  { name: 5, values: [1, 2, 0, 37, 25, 16, 17, 18, 19] },
  { name: 6, values: [] },
]

export const NOINDEX_URLS = getNoIndexURLS(DATA, RU, ENG)
