export default {
  "Мягкая мебель": [
    {
      Кресла: {
        "Для отдыха": "",
        "С подлокотниками": "",
        "Кресла-мешки": {
          category: "kreslo_meshok",
        },
        "кресла-качалки": {
          category: "kreslo_kachalka",
        },
        "Кресла-кровати": "",
        "Кресла ротанг": "",
      },

      Диваны: {
        "Угловые": "Форма=Угловые",
        "Двухместные": "",
        "Трехместные": "",
        "Офисные": "",
        "Для кабинета": "",
        "Для общественных мест": "Назначение=Для общественных мест",
        "Для детских": "Назначение=Для детских",
      },
    },
    {
      "Пуфы": {
        Каркасные: "",
        Безкаркасные: "",
      },

      "Банкетки": {
        Каркасные: "",
        Безкаркасные: "",
      },

      "Софы": {
        Угловые: "",
        Прямые: "",
      },

      "Кушетки": {},
      "Тахты": {},
      "Раскладушки": {},
      "Диваны-кровати": {},
    },
  ],

  "Гостиные": [
    {
      Столы: {
        "Обеденные": "Тип=Обеденный",
        "Журнальные": "Тип=Журнальный",
        "Консольные": "Тип=Консольный",
        "Сервировочные": "Тип=Сервировочный",
        "Приставные": "Тип=Приставной",
        "Кофейные": "Тип=Кофейный",
        "Раздвижные": "Тип раскладывания=Раздвижной",
        "Нераздвижные": "",
        "Столы-книжки": "Тип раскладывания=Книжка",
      },

      Витрины: {
        "Угловые": "",
        "Для посуды": "",
        "Буфеты": {
          category: "bufet",
        },
        "Шкафы витрины": {
          category: "shkaf",
          query: "Тип=Шкаф-витрина",
        },
      },
    },

    {
      Зеркала: {
        "Круглые": "Форма=Круглые",
        "Овальные": "Форма=Овальное",
        "Прямоугольные": "Форма=Прямоугольное",
        "Без багета": "",
        "С багетом": "",
        "Навесные": "Тип=Навесное",
        "Отдельностоящие": "",
      },

      Стенки: {
        "Модульные": "",
        "Композиции готовые": "",
      },

      Полки: {
        Навесные: "",
        Антресольные: "",
      },
    },
    {
      "Винные шкафы": {
        "Винный шкаф-бар": "",
      },

      "Комоды": {
        Бюро: "",
      },

      "Стулья": {
        "С подлокотниками": "",
      },

      "Буфеты": {},
    },
  ],

  "Детские": [
    {
      Кровати: {
        "Односпальные": "Тип=Односпальная",
        "Полуторные": "Тип=Полуторная",
        "Двухспальные": "Тип=Двухспальная",
        "Двухярусные": "",
        "Диваны-кровати": {
          category: "divan_krovat",
        },
        "Каркасные": "",
        "Мягкие": "",
        "С ортопедическим основанием": "Основание=Ортопедическое основание",
        "Кровати-чердаки": {
          category: "detskaya_krovat",
          query: "Тип=Кровать-чердак",
        },
      },

      Стулья: {
        "С подлокотниками": "",
        "Компьютерные детские": "",
      },
    },

    {
      Комоды: {
        "Высокие": "",
        "Широкие": "",
        "С ящиками": "",
        "С дверцами и ящиками": "",
        "Пеленальные": "",
      },

      Стеллажи: {
        Угловые: "Форма=Угловой",
        Отдельностоящие: "",
      },

      Полки: {
        Навесные: "",
        Антресольные: "",
      },
    },
    {
      "Шкафы": {
        "Угловые": "Тип=Угловой",
        "Комбинированные": "Тип=Комбинированный",
        "Для одежды": "Тип=Для одежды",
        "Платьяные": "Тип=Платяной",
        "Шкафы-пеналы": "",
        "Шкафы-купе": "",
        "Шкафы-витрины": "Тип=Шкаф-витрина",
      },

      "Тумбы прикроватные": {
        category: "tumba",
        query: "Тип=Прикроватная",
        values: {
          "С ящиками": "",
          "С дверцами": "",
          "Приставные": "",
        },
      },
    },
  ],

  "Спальни": [
    {
      Кровати: {
        "Односпальные": "Тип=Односпальная",
        "Полуторные": "Тип=Полуторная",
        "Двухспальные": "Тип=Двухспальная",
        "Каркасные": "",
        "Мягкие": "",
        "С ортопедическим основанием": "Основание=Ортопедическое основание",
      },

      Шкафы: {
        "Угловые": "Тип=Угловой",
        "Комбинированные": "Тип=Комбинированный",
        "Для одежды": "Тип=Для одежды",
        "Платьяные": "Тип=Платяной",
        "Шкафы-пеналы": "",
        "Шкафы-купе": "",
        "Шкафы-витрины": "Тип=Шкаф-витрина",
      },
    },

    {
      "Тумбы прикроватные": {
        category: "tumba",
        query: "Тип=Прикроватная",
        values: {
          "С ящиками": "",
          "С дверцами": "",
          "Приставные": "",
        },
      },

      "Комоды": {
        "Высокие": "",
        "Широкие": "",
        "С ящиками": "",
        "С дверцами и ящиками": "",
      },

      "Столы туалетные": {
        category: "stol",
        query: "",
        values: {
          "С зеркалом": "",
          "Однотумбовые": "",
          "Двухтумбовые": "",
          "Приставные": "Тип=Приставной",
        },
      },
    },
  ],

  "Кухни": [
    {
      /*
      "Кухни": {
        "Модульные готовые": "",
        "На заказ": "",
      },
      */

      "Стулья": {
        "С подлокотниками": "",
        "Компьютерные детские": "",
        "На металлокаркасе": "",
        "Деревянные": "",
        "С мягкой спинкой": "",
        "Табуреты": {
          category: "taburet",
        },
        "Табуреты складные": "",
        "Барные": "",
      },

      "Винные шкафы": {
        "Винный шкаф-бар": "",
      },
    },
    {
      Столы: {
        "Обеденные": "Тип=Обеденный",
        "Журнальные": "Тип=Журнальный",
        "Кухонные": "Тип=Кухонный",
        "Консольные": "Тип=Консольный",
        "Кофейные": "Тип=Кофейный",
        "Сервировочные": "Тип=Сервировочный",
        "Приставные": "Тип=Приставной",
        "Раздвижные": "Тип раскладывания=Раздвижной",
        "Нераздвижные": "",
        "Столы-книжки": "Тип раскладывания=Книжка",
      },

      Буфеты: {},
    },
  ],

  "Прихожие": [
    {
      "Прихожие (комплекты)": {
        category: "prihojaya",
        values: {
          "Модульные": "",
          "Угловые": "Тип=Угловая",
          "Панели-вешалки": "",
          "Отдельностоящие вешалки": "",
        },
      },
      "Обувницы": {
        "Комоды-обувницы": "",
        "Пуфы-обувницы": "",
      },
      "Комоды": {
        "Высокие": "",
        "Широкие": "",
        "С ящиками": "",
        "С дверцами и ящиками": "",
      },
    },
    {
      Зеркала: {
        "Круглые": "Форма=Прямоугольное",
        "Овальные": "Форма=Овальное",
        "Прямоугольные": "Форма=Прямоугольное",
        "Без багета": "",
        "С багетом": "",
        "Навесные": "Тип=Навесное",
        "Отдельностоящие": "",
      },

      Пуфы: {
        Каркасные: "",
        Безкаркасные: "",
      },

      Банкетки: {
        Каркасные: "",
        Безкаркасные: "",
      },
    },
  ],

  "Малые формы": [
    {
      Этажерки: {
        Угловые: "Форма=Угловая",
        Открытые: "",
      },
      Подставки: {
        "Под цветы": "Тип=Цветочница",
        "Интерьерные": "",
      },
      Цветочницы: {
        "Деревянные": "",
        "Металлические": "",
        "Цветочницы-горшки": "",
      },
    },
    {
      Консоли: {
        category: "stol",
        query: "Тип=Консольный",
        values: {
          "Столик консольный приставной": "",
          "Столик консольный отдельностоящий": "",
        },
      },
      Стеллажи: {
        Улоговые: "Форма=Угловой",
        Отдельностоящие: "",
      },
    },
  ],

  "Офис": [
    {
      "Письменные столы": {
        category: "stol",
        query: "Тип=Письменный",
        values: {
          "Однотумбовые": "",
          "Двухтумбовые": "",
          "Офисные": "Назначение=Для офиса",
          "Бюро": "",
          "На ножках": "",
          "Для переговоров": "",
          "Стол-брифинг": "",
        },
      },
      "Компьютерные столы": {
        category: "stol",
        query: "Тип=Компьютерный",
        values: {
          "Однотумбовые": "",
          "Двухтумбовые": "",
          "Угловые": "Форма=Угловой",
          "Стеклянные на металлокаркасе": "",
        },
      },
    },
    {
      "Кресла": {
        "Компьтерные": "Тип=Компьютерное",
        "Для руководителей": "",
        "Операторские": "",
      },
      "Стеллажи": {
        "Открытые": "",
        "Для бумаг": "",
        "Для книг": "",
        "Картотеки": "",
      },
      "Книжные шкафы": {
        category: "shkaf",
        query: "Тип=Книжный",
        values: {
          "Офисные": "Назначение=Для офиса",
          "Книжные столы для кабинетов руководителя": "",
        },
      },
      "Акссесуары": {
        Вешалки: {
          category: "veshalka",
        },
      },
    },
  ],
}
