// ck  - catalog_keywords
// cd  - catalog_description
// pka - product_keywords_attrs
// pkv - product_keywords_vars

export default {
  banketka: {
    ck: "Мебель, Банкетки",
    cd: "банкеток",
  },

  bufet: {
    ck: "Мебель, Буфеты",
    cd: "буфетов",
  },

  veshalka: {
    pka: ["Тип"],
    ck: "Мебель, Вешалки, Настенные, Гардеробные, Групповые, Костюмные",
    cd: "вешалок: гардеробные, настенные, групповые, костюмные",
  },

  winniy_shkaf: {
    ck: "Мебель, Винные шкафы",
    cd: "винных шкафов",
  },

  vitrina: {
    ck: "Мебель, Витрины",
    cd: "витрин",
  },

  detskaya_krovat: {
    pka: ["Тип"],
    pkv: ["Комплектация"],
    ck: "Мебель, Кровать двухъярусная, кровать-чердак, детская кровать",
    cd: "детских кроватей",
  },

  divan: {
    pka: ["Форма", "Тип раскладывания"],
    pkv: ["Ориентация"],
    ck: "Мебель, Диваны, Угловые, Раздвижные, Раскладные, Трансформер, Книжка, Книжка 3-x позиционная, Французская раскладушка, Дельфин, Еврокнижка, Аккордеон, Клик-кляк",
    cd: "диванов: угловые, раздвижные, раскладные, трансформер, книжка, книжка 3-x позиционная, французская раскладушка, дельфин, еврокнижка, аккордеон, клик-кляк",
  },

  divan_krovat: {
    pka: ["Форма", "Тип раскладывания"],
    pkv: ["Ориентация", "Комплектация"],
    ck: "Мебель, Диваны-кровати, Угловые, Раздвижные, Раскладные, Трансформер, Книжка, Книжка 3-x позиционная, Французская раскладушка, Дельфин, Еврокнижка, Аккордеон, Клик-кляк, С матрасом, Без матраса",
    cd: "диванов-кроватей: угловые, раздвижные, раскладные, трансформер, книжка, книжка 3-x позиционная, французская раскладушка, дельфин, еврокнижка, аккордеон, клик-кляк, с матрасом, без матраса",
  },

  zerkalo: {
    pka: ["Установка", "Форма"],
    ck: "мебель, зеркала, настенные, напольные, навесные, круглые, овальные, прямоугольные",
    cd: "зеркал: настенные, напольные, навесные, круглые, овальные, прямоугольные",
  },

  komod: {
    pka: ["Особенности"],
    ck: "мебель, комоды, на колесиках, выдвижная внутренняя секция",
    cd: "комодов",
  },

  kreslo: {
    pka: ["Тип", "Конструктивные особенности"],
    ck: "мебель, кресла, Компьютерное, Офисное, Вращающееся, Компьютерное детское, Складное, Детское, Геймерское, Регулировка по высоте",
    cd: "кресел: компьютерные, офисные, вращающиеся, компьютерные детские, складные, детские, геймерские, с регулировкой по высоте",
  },

  kreslo_kachalka: {
    ck: "мебель, кресло-качалка",
    cd: "кресел-качалок",
  },

  kreslo_meshok: {
    ck: "мебель, кресло-мешок",
    cd: "кресел-мешков",
  },

  krovat: {
    pka: ["Тип", "Основание"],
    pkv: ["Комплектация", "Тип опоры"],
    ck: "Мебель для спальни, Кровати для спальни, Кровать двухспальная односпальная подъемная полуторная двухъярусная ортопедическая без решетки, с матрасом, без матраса",
    cd: "кроватей: двухспальные, односпальные, подъемные, полуторные, двухъярусные, ортопедические, без решетки, с матрасом, без матраса",
  },

  kushetka: {
    ck: "мебель, кушетки",
    cd: "кушеток",
  },

  podstavka: {
    pka: ["Тип", "Форма"],
    pkv: ["Ориентация"],
    ck: "Мебель, Подставки, Цветочницы, Приставные",
    cd: "подставок: приставные, цветочницы, разных форм и размеров",
  },

  polka: {
    pka: ["Тип", "Форма", "Установка"],
    pkv: ["Наполнение"],
    ck: "Мебель, Полки для книг, Полки для обуви, Полки для туалета, Полки для ванной комнаты, Универсальные, Прямые, Угловые, Настенные, Напольные, Подвесные",
    cd: "полок: для книг, для обуви, для туалета, для ванной комнаты, универсальные, прямые, угловые, настенные, напольные, подвесные",
  },

  prihojaya: {
    pka: ["Тип", "Особенности"],
    ck: "мебель, прихожие, угловые, настенные, с зеркалом, распашные",
    cd: "прихожих: угловые, настенные, с зеркалом, распашные",
  },

  puf: {
    ck: "Мебель, Пуфы",
    cd: "пуфов",
  },

  raskladushka: {
    ck: "Мебель, Раскладушки",
    cd: "раскладушек",
  },

  sofa: {
    pka: ["Форма", "Тип расскладывания"],
    pkv: ["Ориентация"],
    ck: "Мебель, Софа раздвижная раскладная трансформер книжка еврокнижка дельфин клик-кляк угловая, французская раскладушка",
    cd: "соф: раздвижные, раскладные, трансформеры, книжки, еврокнижки, дельфины, клик-кляк, угловые, французские раскладушки, аккордионы",
  },

  stelaj: {
    pka: ["Форма"],
    pkv: ["Наполнение"],
    ck: "Мебель, Стеллажи",
    cd: "стеллажей",
  },

  stenka: {
    ck: "Мебель, Стенки",
    cd: "стенок",
  },

  stol: {
    pka: ["Форма", "Тип", "Тип расскладывания"],
    pkv: ["Ориентация"],
    ck: "Мебель, Стол журнальный компьютерный кухонный кофейный письменный офисный раздвижной расскладной книжка трансформер круглый прямоугольный квадратный овальный полукруг угловой",
    cd: "столов: журнальные, компьютерные, кухонные, кофейные, письменные, офисные, раздвижные, расскладные, трансформеры, круглые, полукруглые, овальные, квадратные, прямоугольные, угловые",
  },

  stul: {
    pka: ["Конструктивные особенности"],
    ck: "Мебель, Стулья",
    cd: "стульев",
  },

  taburet: {
    ck: "Мебель, Табуреты",
    cd: "табуретов",
  },

  tahta: {
    pka: ["Форма"],
    pkv: ["Комплектация"],
    ck: "Мебель, Тахты",
    cd: "тахт",
  },

  tualetniy_stolik: {
    pka: ["Тип", "Ориентация", "Тип фасада", "Особенности"],
    ck: "Мебель, Туалетные столики, Однотумбовые, Двухтумбовые, С ящиками, С дверцами, С зеркалом",
    cd: "туалетных столиков: однотумбовые, двухтумбовые, с ящиками, с дверцами, с зеркалом",
  },

  tumba: {
    pka: ["Тип", "Особенности"],
    ck: "Мебель, Тумбы, Сундук, Подкатная, Тумба под телефон, ТВ тумба, Обувница, Угловая, На колесиках",
    cd: "тумбы-сундуки, тумбы под телефон, ТВ-тумбы, обувницы, подкатные, угловые, на колесиках, с выдвижной внутренней секцией",
  },

  shkaf: {
    pka: ["Тип", "Тип открывания дверей", "Установка"],
    pkv: ["Размерный ряд"],
    ck: "Мебель, Шкафы, Напольный, Навесный, Антресоль, Угловой, Мобильный, Детский, Для белья, Для одежды, Для обуви, Плетяной, Шкаф-бюро, Книжный, Многофункциональный, Комбинированный, Шкаф-витрина",
    cd: "шкафов: напольные, навесные, антресоли, угловые, мобильные, детские, для белья, для одежды, для обуви, плетяные, шкафы-бюро, книжные, многофункциональные, комбинированные, шкафы-витрины",
  },

  etajerka: {
    pka: ["Форма", "Особенности", "Установка"],
    ck: "Мебель, Этажерки напольные навесные настенные угловые на колесиках",
    cd: "этажерок: напольные, навесные, настенные, угловые, на колесиках",
  },
}
