export default {
  "stol": ["Тип", "Форма", "Материал каркаса", "Тип раскладывания"],

  "podstavka": ["Тип", "Форма", "Материал каркаса"],

  "tualetniy_stolik": ["Тип", "Тип фасада", "Материал каркаса", "Особенности"],

  "tumba": ["Тип", "Материал каркаса", "Особенности"],

  "zerkalo": ["Форма", "Тип", "Материал багета"],

  "vitrina": ["Тип", "Материал каркаса"],

  "stenka": ["Тип", "Материал каркаса"],

  "veshalka": ["Тип", "Материал каркаса"],

  "prihojaya": ["Тип", "Материал каркаса", "Особенности"],

  "winniy_shkaf": ["Тип", "Материал каркаса"],

  "shkaf": ["Тип", "Материал каркаса", "Установка"],

  "komod": ["Материал каркаса"],

  "etajerka": ["Форма", "Установка", "Материал каркаса"],

  "stelaj": ["Форма", "Материал каркаса"],

  "bufet": ["Тип", "Материал каркаса"],

  "polka": ["Форма", "Установка", "Материал каркаса"],

  "krovat": ["Спальное место", "Материал каркаса", "Тип", "Основание"],

  "raskladushka": ["Материал каркаса"],

  "tahta": [],
  "kushetka": [],

  "divan_krovat": ["Форма", "Тип раскладывания"],

  "sofa": ["Форма", "Тип раскладывания"],

  "kreslo": ["Материал каркаса", "Тип"],

  "stul": ["Материал каркаса"],

  "taburet": ["Материал каркаса"],

  "kreslo_meshok": ["Размеры"],

  "kreslo_kachalka": ["Материал каркаса"],

  "banketka": [],

  "puf": ["Материал каркаса"],

  "detskaya_krovat": [
    "Тип",
    "Внешний вид",
    "Спальное место",
    "Материал каркаса",
  ],

  "zaschischennie-telefoni-i-smartfoni": ["Тип"],
}
