import React from "react"
import styled from "styled-components"

const Description = () => (
  <div>
    <H1>Интернет-магазин yoursite - мебель, электроника, товары для дома.</H1>
    <p>Добро пожаловать на yoursite.ru</p>
    <p>
      Наше время, безусловно, можно назвать веком информационных технологий и
      инноваций. Скорость, с которой развивается мир, с каждым днем становится
      все выше и выше. Мы все становимся очень занятыми. Если десять лет назад
      главным объектом экономии были деньги, то сегодня это, конечно же, время.
      Мы всячески стараемся его сберечь, для того чтобы посвятить его тому, чем
      мы, действительно, хотим заниматься.
    </p>
    <p>
      И цифровой век дает нам решение этой задачи. Совершая покупки Online, мы
      экономим время. Вся информация о продукте полностью перед Вами в удобном
      для восприятия виде. Вы можете рассмотреть разные варианты оформления и
      комплектации и сделать заказ буквально за несколько кликов. И заказ будет
      доставлен, куда Вам нужно и когда Вам нужно.
    </p>
    <p>
      Но также мы экономим и деньги, интернет-магазины, в отличии от
      традиционной торговли, не обременены огромными издержками по аренде
      торговых помещений и содержанию огромного штата сотрудников. Поэтому мы
      можем предложить Вам, самые привлекательные цены на нашу продукцию.
      Гибкость, которую предоставляет Интернет-торговля, позволяет нам постоянно
      обновлять категории наших товаров, поэтому Вы всегда можете приобрести в
      нашем магазине не только те товары, которые используете постоянно, но и
      самые последние новинки в абсолютно любых направлениях.
    </p>
    <p>
      Интернет-магазин - это будущее торговли, а для Вас оно наступило уже
      сейчас.
    </p>
    <p>Желаем приятных и выгодных покупок на yoursite.ru</p>
  </div>
)

export default Description

const H1 = styled.h1`
  margin: 40px 0;
  font-size: 22px;
`
